---
title: ModelPath
classe: Autodesk.Revit.DB.ModelPath
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# ModelPath

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CentralServerPath { get; }` | `modelPath.CentralServerPath` | String |
| `Boolean CloudPath { get; }` | `modelPath.CloudPath` | Boolean |
| `Boolean Empty { get; }` | `modelPath.Empty` | Boolean |
| `Boolean IsValidObject { get; }` | `modelPath.IsValidObject` | Boolean |
| `String Region { get; }` | `modelPath.Region` | String |
| `Boolean ServerPath { get; }` | `modelPath.ServerPath` | Boolean |
| `Int32 Compare(ModelPath)` | `modelPath.Compare(otherPath)` | Int32 |
| `Void Dispose()` | `modelPath.Dispose()` | Void |
| `Guid GetModelGUID()` | `modelPath.GetModelGUID()` | Guid |
| `Guid GetProjectGUID()` | `modelPath.GetProjectGUID()` | Guid |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```